export const object =
{
    "subjects": [
        {
            "key": 1,
            "name": "algebre",
            "allCoursTime": 50,
            "timePeerWeak": 600,
            "specificLearningTime": 10,
            "labels": [
                "15.1.20",
                "16.1.20",
                "17.1.20",
                "18.1.20",
                "19.1.20",
                "20.1.20"
            ],
            "datasets": [
                {
                    "data": [
                        23,
                        20,
                        3,
                        106,
                        47,
                        30
                    ],
                    "color": (opacity = 1) => `rgba(134, 65, 244, ${2})`
                },
                {
                    "data": [
                        "20",
                        "10",
                        "4",
                        "56",
                        "87",
                        "90"
                    ],
                    "color": (opacity = 1) => `rgba(100, 40, 0, ${2})`
                },
                {
                    "data": [
                        "30",
                        "90",
                        "67",
                        "54",
                        "10",
                        "2"
                    ]
                }
            ]
        },
        {
            "key": 2,
            "name": "ליניארית",
            "allCOursTime": 100,
            "specificLearningTime": 12,
            "labels": [
                "15.1.20",
                "16.1.20",
                "17.1.20",
                "18.1.20",
                "19.1.20",
                "20.1.20"
            ],
            "datasets": [
                {
                    "data": [
                        70,
                        3,
                        106,
                        20,
                        47,


                        30
                    ],
                    "color": (opacity = 1) => `rgba(134, 65, 244, ${2})`
                },
                {
                    "data": [
                        "20",
                        "10",
                        "4",
                        "56",
                        "87",
                        "90"
                    ],
                    "color": (opacity = 1) => `rgba(100, 40, 0, ${2})`
                },
                {
                    "data": [
                        "30",
                        "90",
                        "67",
                        "54",
                        "10",
                        "2"
                    ]
                }
            ]
        },
        {
            "key": 3,
            "name": "בדידה",
            "allCOursTime": 600,
            "specificLearningTime": 60,
            "labels": [
                "15.1.20",
                "16.1.20",
                "17.1.20",
                "18.1.20",
                "19.1.20",
                "20.1.20"
            ],
            "datasets": [
                {
                    "data": [
                        23,
                        20,
                        3,
                        106,
                        47,
                        30
                    ],
                    "color": (opacity = 1) => `rgba(134, 65, 244, ${2})`
                },
                {
                    "data": [
                        "20",
                        "10",
                        "4",
                        "56",
                        "87",
                        "90"
                    ],
                    "color": (opacity = 1) => `rgba(100, 40, 0, ${2})`
                },
                {
                    "data": [
                        "30",
                        "90",
                        "67",
                        "54",
                        "10",
                        "2"
                    ]
                }
            ]
        },
        {
            "key": 4,
            "name": "מבוא למדמח",
            "allCOursTime": 10,
            "specificLearningTime": 10,
            "labels": [
                "15.1.20",
                "16.1.20",
                "17.1.20",
                "18.1.20",
                "19.1.20",
                "20.1.20"
            ],
            "datasets": [
                {
                    "data": [
                        23,
                        20,
                        3,
                        106,
                        47,
                        30
                    ],
                    "color": (opacity = 1) => `rgba(134, 65, 244, ${2})`
                },
                {
                    "data": [
                        "20",
                        "10",
                        "4",
                        "56",
                        "87",
                        "90"
                    ],
                    "color": (opacity = 1) => `rgba(100, 40, 0, ${2})`
                },
                {
                    "data": [
                        "30",
                        "90",
                        "67",
                        "54",
                        "10",
                        "2"
                    ]
                }
            ]
        }
    ]
}